9/data/attachments/baa23465dc308e20.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_023a720d-da53-4df2-83d6-81a01cdc8840</nif:username>
            <nif:friendToBeAdded>Timothy_behind_Friend_97112_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>